In [1]:
# Sales Data Cleaning and Analysis

In [2]:
import pandas as pd

In [3]:
# Loading Dataset

In [4]:
df = pd.read_csv('sales_data_sample.csv', encoding = "ISO-8859-1")

In [35]:
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,PRODUCTLINE,PRODUCTCODE,CITY,STATE,COUNTRY,TERRITORY,DEALSIZE,Month,Year
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,Motorcycles,S10_1678,NYC,NY,USA,Unknown Region,Small,2,2003
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,Motorcycles,S10_1678,Reims,Unknown,France,EMEA,Small,5,2003
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,Motorcycles,S10_1678,Paris,Unknown,France,EMEA,Medium,7,2003
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,Motorcycles,S10_1678,Pasadena,CA,USA,Unknown Region,Medium,8,2003
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,Motorcycles,S10_1678,San Francisco,CA,USA,Unknown Region,Medium,10,2003

In [34]:
Column_names = df.columns
Column_names

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'PRODUCTLINE', 'PRODUCTCODE', 'CITY',
       'STATE', 'COUNTRY', 'TERRITORY', 'DEALSIZE', 'Month', 'Year'],
      dtype='object')

In [7]:
# Handling Missing Values

In [36]:
Missing_values = df.isnull().sum()
Missing_values

ORDERNUMBER        0
QUANTITYORDERED    0
PRICEEACH          0
ORDERLINENUMBER    0
SALES              0
ORDERDATE          0
STATUS             0
PRODUCTLINE        0
PRODUCTCODE        0
CITY               0
STATE              0
COUNTRY            0
TERRITORY          0
DEALSIZE           0
Month              0
Year               0
dtype: int64

In [9]:
df['TERRITORY']= df['TERRITORY'].fillna('Unknown Region')

In [10]:
df['STATE']= df['STATE'].fillna('Unknown')

In [11]:
# Dropping Irrelevant Columns

In [33]:
Dropping_columns = df.drop(columns = ['QTR_ID','MONTH_ID','YEAR_ID','MSRP','CUSTOMERNAME','PHONE','ADDRESSLINE1', 'ADDRESSLINE2','POSTALCODE','CONTACTLASTNAME', 'CONTACTFIRSTNAME'],inplace = True)

In [13]:
# Converting ORDERDATE to Datetime and creating Month/Year columns

In [14]:
df['ORDERDATE'] = pd.to_datetime(df['ORDERDATE'])

In [15]:
df['Month'] = df['ORDERDATE'].dt.month
df['Year'] = df['ORDERDATE'].dt.year

In [16]:
## Insights

In [17]:
# Monthly Sales

In [18]:
monthly_sales = df.groupby(['Year','Month'])['SALES'].sum().reset_index()
monthly_sales

    Year  Month       SALES
0   2003      1   129753.60
1   2003      2   140836.19
2   2003      3   174504.90
3   2003      4   201609.55
4   2003      5   192673.11
5   2003      6   168082.56
6   2003      7   187731.88
7   2003      8   197809.30
8   2003      9   263973.36
9   2003     10   568290.97
10  2003     11  1029837.66
11  2003     12   261876.46
12  2004      1   316577.42
13  2004      2   311419.53
14  2004      3   205733.73
15  2004      4   206148.12
16  2004      5   273438.39
17  2004      6   286674.22
18  2004      7   327144.09
19  2004      8   461501.27
20  2004      9   320750.91
21  2004     10   552924.25
22  2004     11  1089048.01
23  2004     12   372802.66
24  2005      1   339543.42
25  2005      2   358186.18
26  2005      3   374262.76
27  2005      4   261633.29
28  2005      5   457861.06

In [19]:
# Yearly Sales

In [20]:
yearly_sales = df.groupby('Year')['SALES'].sum().reset_index().sort_values(by = 'SALES',ascending = False)
yearly_sales

   Year       SALES
1  2004  4724162.60
0  2003  3516979.54
2  2005  1791486.71

In [21]:
# City-wise Sales

In [22]:
city_sales = df.groupby('CITY')['SALES'].sum().reset_index().sort_values(by = 'SALES',ascending = False)
city_sales

           CITY       SALES
34       Madrid  1082551.44
61   San Rafael   654858.06
42          NYC   560787.77
63    Singapore   288488.41
52        Paris   268944.68
..          ...         ...
9      Brisbane    50218.51
31  Los Angeles    48048.46
11      Burbank    46084.64
41       Munich    34993.92
14    Charleroi    33440.10

[73 rows x 2 columns]

In [23]:
# Top Product Lines

In [24]:
top_product_lines = df.groupby('PRODUCTLINE')['SALES'].sum().sort_values(ascending = False).head(5)
top_product_lines

PRODUCTLINE
Classic Cars        3919615.66
Vintage Cars        1903150.84
Motorcycles         1166388.34
Trucks and Buses    1127789.84
Planes               975003.57
Name: SALES, dtype: float64

In [37]:
df.to_csv('cleaned_sales_data.csv')